experiments/results/logs/periodic-hpa-010/wrk2.txt
Running 10m test @ http://localhost:30080/
  4 threads and 100 connections
  Thread calibration: mean lat.: 5951.726ms, rate sampling interval: 15769ms
  Thread calibration: mean lat.: 5575.009ms, rate sampling interval: 14573ms
  Thread calibration: mean lat.: 6036.130ms, rate sampling interval: 16056ms
  Thread calibration: mean lat.: 6031.512ms, rate sampling interval: 15646ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.91m    29.39s    1.83m    56.38%
    Req/Sec     0.83      1.65     5.00     84.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.89m 
 75.000%    1.33m 
 90.000%    1.60m 
 99.000%    1.80m 
 99.900%    1.82m 
 99.990%    1.83m 
 99.999%    1.83m 
100.000%    1.83m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    8486.911     0.000000            4         1.00
   15851.519     0.100000          215         1.11
   23773.183     0.200000          431         1.25
   31883.263     0.300000          644         1.43
   42467.327     0.400000          859         1.67
   53149.695     0.500000         1073         2.00
   58785.791     0.550000         1183         2.22
   63864.831     0.600000         1288         2.50
   68812.799     0.650000         1395         2.86
   74579.967     0.700000         1503         3.33
   79757.311     0.750000         1610         4.00
   83689.471     0.775000         1664         4.44
   85524.479     0.800000         1718         5.00
   89587.711     0.825000         1771         5.71
   91553.791     0.850000         1825         6.67
   94240.767     0.875000         1879         8.00
   95289.343     0.887500         1909         8.89
   96075.775     0.900000         1932        10.00
   96993.279     0.912500         1959        11.43
   99680.255     0.925000         1987        13.33
  100794.367     0.937500         2014        16.00
  101187.583     0.943750         2026        17.78
  101515.263     0.950000         2040        20.00
  101777.407     0.956250         2054        22.86
  102301.695     0.962500         2067        26.67
  103743.487     0.968750         2079        32.00
  105250.815     0.971875         2086        35.56
  105906.175     0.975000         2093        40.00
  106758.143     0.978125         2101        45.71
  106823.679     0.981250         2107        53.33
  106954.751     0.984375         2114        64.00
  107020.287     0.985938         2117        71.11
  107741.183     0.987500         2120        80.00
  107806.719     0.989062         2123        91.43
  107872.255     0.990625         2126       106.67
  108003.327     0.992188         2130       128.00
  108068.863     0.992969         2133       142.22
  108068.863     0.993750         2133       160.00
  108199.935     0.994531         2135       182.86
  108331.007     0.995313         2136       213.33
  108789.759     0.996094         2138       256.00
  108986.367     0.996484         2140       284.44
  108986.367     0.996875         2140       320.00
  109117.439     0.997266         2142       365.71
  109117.439     0.997656         2142       426.67
  109117.439     0.998047         2142       512.00
  109182.975     0.998242         2145       568.89
  109182.975     0.998437         2145       640.00
  109182.975     0.998633         2145       731.43
  109182.975     0.998828         2145       853.33
  109182.975     0.999023         2145      1024.00
  109182.975     0.999121         2145      1137.78
  109182.975     0.999219         2145      1280.00
  109182.975     0.999316         2145      1462.86
  109182.975     0.999414         2145      1706.67
  109182.975     0.999512         2145      2048.00
  109969.407     0.999561         2146      2275.56
  109969.407     1.000000         2146          inf
#[Mean    =    54602.541, StdDeviation   =    29388.982]
#[Max     =   109903.872, Total count    =         2146]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2309 requests in 10.00m, 23.73MB read
  Socket errors: connect 0, read 7, write 0, timeout 27659
Requests/sec:      3.85
Transfer/sec:     40.49KB